{
  "_name_or_path": "apple/deeplabv3-mobilevit-small",
  "architectures": [
    "MobileViTForSemanticSegmentation"
  ],
  "aspp_dropout_prob": 0.1,
  "aspp_out_channels": 256,
  "atrous_rates": [
    6,
    12,
    18
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "conv_kernel_size": 3,
  "expand_ratio": 4.0,
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.1,
  "hidden_sizes": [
    144,
    192,
    240
  ],
  "id2label": {
    "0": "background",
    "1": "can",
    "2": "glass",
    "3": "paper",
    "4": "plastic",
    "5": "styrofoam",
    "6": "vinyl"
  },
  "image_size": 512,
  "initializer_range": 0.02,
  "label2id": {
    "background": 0,
    "can": 1,
    "glass": 2,
    "paper": 3,
    "plastic": 4,
    "styrofoam": 5,
    "vinyl": 6
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 2.0,
  "model_type": "mobilevit",
  "neck_hidden_sizes": [
    16,
    32,
    64,
    96,
    128,
    160,
    640
  ],
  "num_attention_heads": 4,
  "num_channels": 3,
  "output_stride": 16,
  "patch_size": 2,
  "qkv_bias": true,
  "semantic_loss_ignore_index": 255,
  "torch_dtype": "float32",
  "transformers_version": "4.35.0"
}
